
Процедура ПолучитьИзмененияОстатков(НастройкаОбмена, ДатаВыгрузки, МенеджерВТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ос_ИсторияИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияОстатков.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ втНоменклатураХарактеристика
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияОстатков КАК ос_ИсторияИзмененияОстатков
	               |ГДЕ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияОстатков.НастройкаОбмена <= &ДатаВыгрузки";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
	РезультатЗапроса = Запрос.Выполнить();
		
КонецПроцедуры

Процедура ЗаписатьИзмененияОтстатков(Склад, Номенклатура, Характеристика) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_НастройкиОбменаССайтами.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ос_НастройкиОбменаССайтами КАК ос_НастройкиОбменаССайтами
	               |ГДЕ
	               |	НЕ ос_НастройкиОбменаССайтами.ПометкаУдаления
	               |	И ос_НастройкиОбменаССайтами.РегистрироватьИзмененияОстатков";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьИзмененияОтстатковПоНастройкеОбмена(Выборка.Ссылка, Склад, Номенклатура, Характеристика);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаписатьИзмененияОтстатковПоНастройкеОбмена(НастройкаОбмена, Склад, Номенклатура, Характеристика)
	
	МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
	МЗ.Дата = ТекущаяДата();
	МЗ.НастройкаОбмена = НастройкаОбмена;
	МЗ.Склад = Склад;
	МЗ.Номенклатура = Номенклатура;
	МЗ.Характеристика = Характеристика;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИзмененияОстатковДоДаты(НастройкаОбмена, ДатаОкончания) Экспорт
	
	Если ДатаОкончания = Дата(1,1,1) 
		ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена КАК НастройкаОбмена,
	               |	ос_ИсторияИзмененияОстатков.Склад КАК Склад,
	               |	ос_ИсторияИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияОстатков.Характеристика КАК Характеристика,
	               |	ос_ИсторияИзмененияОстатков.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияОстатков КАК ос_ИсторияИзмененияОстатков
	               |ГДЕ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияОстатков.Дата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.Удалить();
		
	КонецЦикла;
		
КонецПроцедуры

//--

Процедура ПолучитьИзмененияЦен(НастройкаОбмена, ДатаВыгрузки, МенеджерВТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ос_ИсторияИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияЦен.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ втНоменклатураХарактеристика
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияЦен КАК ос_ИсторияИзмененияЦен
	               |ГДЕ
	               |	ос_ИсторияИзмененияЦен.Дата <= &Дата
	               |	И ос_ИсторияИзмененияЦен.НастройкаОбмена = &НастройкаОбмена";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаписатьИзмененияЦен(ВидЦен, Номенклатура, Характеристика) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_НастройкиОбменаССайтами.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ос_НастройкиОбменаССайтами КАК ос_НастройкиОбменаССайтами
	               |ГДЕ
	               |	НЕ ос_НастройкиОбменаССайтами.ПометкаУдаления
	               |	И ос_НастройкиОбменаССайтами.РегистрироватьИзмененияЦен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьИзмененияЦенПоНастройкеОбмена(Выборка.Ссылка, ВидЦен, Номенклатура, Характеристика);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаписатьИзмененияЦенПоНастройкеОбмена(НастройкаОбмена, ВидЦен, Номенклатура, Характеристика)
	
	МЗ = РегистрыСведений.ос_ИсторияИзмененияЦен.СоздатьМенеджерЗаписи();
	МЗ.Дата = ТекущаяДата();
	МЗ.ВидЦен = ВидЦен;
	МЗ.НастройкаОбмена = НастройкаОбмена;
	МЗ.Номенклатура = Номенклатура;
	МЗ.Характеристика = Характеристика;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИзмененияЦенДоДаты(НастройкаОбмена, ДатаОкончания) Экспорт
	
	Если ДатаОкончания = Дата(1,1,1) 
		ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_ИсторияИзмененияЦен.НастройкаОбмена КАК НастройкаОбмена,
	               |	ос_ИсторияИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияЦен.Характеристика КАК Характеристика,
	               |	ос_ИсторияИзмененияЦен.Дата КАК Дата,
	               |	ос_ИсторияИзмененияЦен.ВидЦен КАК ВидЦен
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияЦен КАК ос_ИсторияИзмененияЦен
	               |ГДЕ
	               |	ос_ИсторияИзмененияЦен.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияЦен.Дата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.Удалить();
		
	КонецЦикла;
		
КонецПроцедуры



