
Процедура ДобавитьИзмененияМассиваОбъектовПоНастройке(НастройкаОбмена, ТипОбъекта, Массивобъектов) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	МЗ = РегистрыСведений.ос_ИсторияИзменений.СоздатьНаборЗаписей();
	МЗ.Отбор.НастройкаОбмена.Установить(НастройкаОбмена);
	МЗ.Отбор.Тип.Установить(ТипОбъекта);
	МЗ.Отбор.Дата.Установить(ТекущаяДата);
	
	Для каждого СтрМ Из Массивобъектов Цикл
		
		Запись = МЗ.Добавить();
		
		Запись.НастройкаОбмена = НастройкаОбмена;
		Запись.Дата = ТекущаяДата;
		Запись.Тип = ТипОбъекта;
		Запись.Объект = СтрМ;
		
	КонецЦикла;
	МЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьИзмененияОбъекта(НастройкаОбмена, Объект, ДатаОкончания) Экспорт
	
	Если ДатаОкончания = Дата(1,1,1) 
		ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ос_ИсторияИзменений.Настройка КАК Настройка,
	|	ос_ИсторияИзменений.Дата КАК Дата,
	|	ос_ИсторияИзменений.Тип КАК Тип,
	|	ос_ИсторияИзменений.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ос_ИсторияИзменений КАК ос_ИсторияИзменений
	|ГДЕ
	|	ос_ИсторияИзменений.НастройкаОбмена = &НастройкаОбмена
	|	И ос_ИсторияИзменений.Объект = &Объект
	|	И ос_ИсторияИзменений.Дата < &ДатаОкончания";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ос_ИсторияИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка); 
		Запись.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры
